# Grouping & Computing Aggregates

In [1]:
import pandas as pd
import pandas.io.sql as sqlio
import psycopg2

conn = psycopg2.connect("dbname=northwind user=postgres password=password host=localhost port=5433")

### Display a table that counts the number of suppliers from each country.

In [5]:
sql = """
SELECT "Country", count(*)
FROM suppliers
GROUP BY "Country"
"""

data = sqlio.read_sql_query(sql, conn)
data.head(10)

       Country  count
0        Spain      1
1        Italy      2
2       Norway      1
3       Sweden      2
4       France      3
5          USA      4
6  Netherlands      1
7       Brazil      1
8    Australia      2
9           UK      2

### Display

In [4]:
sql = """
SELECT "OrderID", sum("UnitPrice")
FROM order_details
WHERE "ProductID" IN (11, 51, 60)
GROUP BY "OrderID"
"""

data = sqlio.read_sql_query(sql, conn)
data.head(10)

   OrderID   sum
0    10999  53.0
1    10821  53.0
2    10519  34.0
3    10889  21.0
4    10512  34.0
5    10294  27.2
6    11055  53.0
7    10362  42.4
8    10918  34.0
9    10397  42.4

### Display table that counts total amount of Titles

In [6]:
sql = """
SELECT "Title", count(*)
FROM employees
GROUP BY "Title"
"""

data = sqlio.read_sql_query(sql, conn)
data.head(10)

                      Title  count
0     Vice President, Sales      1
1  Inside Sales Coordinator      1
2      Sales Representative      6
3             Sales Manager      1